Revit 2024 API
BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInAnotherDesignOption Property
 A pad in a Design Option cannot be hosted by a topography in another Design Option [--if you continue it will not be added to the design option set].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ConfusingPadByElementsInAnotherDesignOption { get; }
Visual Basic
Public Shared ReadOnly Property ConfusingPadByElementsInAnotherDesignOption As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ConfusingPadByElementsInAnotherDesignOption {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace